Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་དུ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ནང་གི་ཆོས་རྣམས་དང་། ཕྱིའི་ཆོས་རྣམས་དང་། ཕྱི་ནང་གི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ལ། ཆོས་ལ་བརྟེན་པའི་རྣམ་པར་རིག་པ་ཡང་མི་སྐྱེད་པའོ།། །།
en: (4) Those who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to inner phenomena, outer phenomena, and combined inner and outer phenomena, continue to observe phenomena, without generating any apperceptions dependent on phenomena.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ། བམ་པོ་བརྒྱད་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ཤེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་ན་ཡང་སྤྱོད་པར་རབ་ཏུ་ཤེས་སོ། །
en: “Śāradvatī­putra, if you ask how, with regard to the inner body, great bodhisattva beings continue to observe the physical body, when great bodhisattva beings are engaged in conduct, they are fully aware that they are engaged in conduct.

source: འགྲེང་ན་ཡང་བདག་འགྲེང་བར་རབ་ཏུ་ཤེས་སོ། །
en: When they are standing upright, they are fully aware that they are standing upright.

source: འདུག་ན་ཡང་བདག་འདུག་པར་རབ་ཏུ་ཤེས་སོ། །
en: When they are sitting, they are fully aware that they are sitting.

source: ཉལ་ན་ཡང་བདག་ཉལ་བར་རབ་ཏུ་ཤེས་སོ། །
en: When they are lying down, they are fully aware that they are lying down.

source: དེའི་ལུས་ཇི་ལྟ་ཇི་ལྟ་བུར་གནས་པར་གྱུར་པ་དེ་ལྟ་དེ་ལྟ་བུར་རབ་ཏུ་ཤེས་ཏེ།
en: In whatever ways the body changes its posture, they are fully aware of these.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ། །
en: Śāradvatī­putra, it is in such ways that great bodhisattva beings who are diligent, alert and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to the inner body, continue to observe the physical body.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འགྲོའམ་ལྡོག་ཀྱང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན།
en: “Moreover, Śāradvatī­putra, great bodhisattva beings maintain alertness whether they are going out or returning back.

source: ཀུན་ཏུ་ལྟའམ། རྣམ་པར་ལྟ་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན། བསྐུམ་པ་དང་། བརྐྱང་པ་དང་། སྣམ་སྦྱར་དང་། རས་ཡུག་ཆེན་དང་།
en: They maintain alertness whether they are looking outwardly or looking introspectively.

source: ལྷུང་བཟེད་ཐོགས་པ་དང་། ཟ་བ་དང་། འཐུང་བ་དང་། འཆའ་བ་དང་། མྱང་བ་དང་། གཉིད་བསད་པ་དང་། ངལ་བསོ་བ་དང་། འོང་བ་དང་། འགྲོ་བའམ།
en: They maintain alertness whether they are bending or stretching their limbs; whether they are holding an outer patched robe, a waist cloth, or an alms bowl; and whether they are eating, drinking, chewing, tasting, waking up, resting, coming or going, [standing or] sitting, reclining or not reclining, and speaking or not speaking.

source: འདུག་པ་དང་། ཉལ་བ་དང་། མི་ཉལ་བ་དང་། སྨྲ་བ་དང་། མི་སྨྲ་བ་ན་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན།
en: They maintain alertness whether they are absorbed in meditation or arising from meditation.

source: ནང་དུ་ཡང་དག་འཇོག་དང་། ལྡང་ན་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན་ཏེ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ཏེ།
en: Śāradvatī­putra, it is in this way that when great bodhisattva beings practice the transcendent perfection of wisdom with regard to the inner body, they continue to observe the physical body.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་གནས་སོ། །
en: Furthermore, they do so without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དྲན་བཞིན་དུ་དབུགས་རྔུབ་ཅིང་། དྲན་བཞིན་དུ་དབུགས་འབྱིན་ཏེ།
en: “Moreover, Śāradvatī­putra, they breathe in mindfully and breathe out mindfully.

source: དེས་དབུགས་རིང་དུ་བརྔུབས་ན་ཡང་དབུགས་རིང་དུ་བརྔུབས་པ་དང་། དབུགས་རིང་དུ་ཕྱུང་ན་ཡང་དབུགས་རིང་དུ་ཕྱུང་བར་རབ་ཏུ་ཤེས་སོ། །
en: They are fully aware that when they inhale a long breath they are inhaling a long breath, and that when they exhale a long breath, they are exhaling a long breath.

source: དབུགས་ཐུང་ངུ་བརྔུབས་ན་ཡང་དབུགས་ཐུང་ངུ་བརྔུབས་པར་རབ་ཏུ་ཤེས་སོ། །དབུགས་ཐུང་ངུ་ཕྱུང་ན་ཡང་དབུགས་ཐུང་ངུ་ཕྱུང་བར་རབ་ཏུ་ཤེས་སོ། །
en: They are fully aware that when they inhale a short breath, they are inhaling a short breath, and that when they exhale a short breath, they are exhaling a short breath.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་རྫ་མཁན་ནམ། རྫ་མཁན་གྱི་སློབ་མ་མཁས་པས་འཕང་ལོ་སྐོར་བ་ནི་རིང་དུ་སྲུབ་ན་ཡང་རིང་དུ་སྲུབ་པར་རབ་ཏུ་ཤེས་སོ། །ཐུང་ངུ་སྲུབ་ན་ཡང་ཐུང་ངུ་སྲུབ་པར་རབ་ཏུ་ཤེས་སོ། །
en: Śāradvatī­putra, this resembles, for example, a potter or the skilled apprentice of a potter who is fully aware that when he is turning the wheel in a long whirl, he is turning the wheel in a long whirl, and who is fully aware that when he is turning the wheel in a short whirl, he is turning the wheel in a short whirl.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དྲན་བཞིན་དུ་དབུགས་བརྔུབས་ཅིང་། དྲན་བཞིན་དུ་དབུགས་འབྱིན་ཏེ།
en: Likewise, Śāradvatī­putra, great bodhisattva beings breathe in mindfully and breathe out mindfully.

source: དེས་དབུགས་རིང་དུ་བརྔུབས་ན་ཡང་དབུགས་རིང་དུ་བརྔུབས་པར་རབ་ཏུ་ཤེས་སོ། །
en: When they are inhaling a long breath, they are fully aware that they are inhaling a long breath.

source: དབུགས་རིང་དུ་ཕྱུང་ན་ཡང་དབུགས་རིང་དུ་ཕྱུང་བར་རབ་ཏུ་ཤེས་སོ། །
en: When they are exhaling a long breath, they are fully aware that they are exhaling a long breath.

source: དབུགས་ཐུང་ངུ་བརྔུབས་ན་ཡང་དབུགས་ཐུང་ངུ་བརྔུབས་པར་རབ་ཏུ་ཤེས་སོ། །
en: When they are inhaling a short breath, they are fully aware that they are inhaling a short breath.

source: དབུགས་ཐུང་ངུ་ཕྱུང་ན་ཡང་དབུགས་ཐུང་ངུ་ཕྱུང་བར་རབ་ཏུ་ཤེས་སོ། །
en: When they are exhaling a short breath, they are fully aware that they are exhaling a short breath.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ། །
en: Śāradvatī­putra, it is in such ways that great bodhisattva beings who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to the inner body, continue to observe the physical body.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལུས་འདི་ཉིད་ལ་ཁམས་ཀྱིས་སོ་སོར་རྟོག་པར་བྱེད་དེ། ལུས་འདི་ལ་ནི་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ཡོད་དོ་སྙམ་དུ་རྟོག་གོ། །ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་བ་ལང་གསོད་པ་ལ་མཁས་པའམ། བ་ལང་གསོད་པའི་སློབ་མ་མཁས་པས་མཚོན་རྣོན་པོས་བ་ལང་བསད་ནས། བག་བཞིར་གཤགས་ཏེ་གཟུགས་བཞིར་ཕྱེ་ནས་འགྲེང་ངམ་འདུག་སྟེ། སོ་སོར་རྟོག་པ་དེ་བཞིན་དུ།
en: “Moreover, Śāradvatī­putra, great bodhisattva beings analyze this same physical body in terms of its material elements, considering that their bodies comprise the element of earth, the element of water, the element of fire, and the element of wind.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡང་ལུས་འདི་ཉིད་ལ་ཁམས་ཀྱིས་སོ་སོར་རྟོག་པར་བྱེད་དེ། ལུས་འདི་ལ་ནི་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ཡོད་དོ་སྙམ་དུ་རྟོག་སྟེ།
en: Śāradvatī­putra, just as a skilled butcher of bulls or the skilled apprentice of a butcher of bulls slays a bull with a sharp instrument, cuts it into four parts, and then examines the quartered carcass as he stands or sits, in the same way, Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom also examine this same physical body in terms of its material elements, considering that it comprises the element of earth, the element of water, the element of fire, and the element of wind.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ཡིན་ཏེ།
en: Śāradvatī­putra, it is in this way that great bodhisattva beings who practice the transcendent perfection of wisdom with regard to the inner body, continue to observe the physical body.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལུས་འདི་ཉིད་རྐང་པའི་མཐིལ་ཡན་ཆད་སྐྲ་དང་མགོ་བོ་མན་ཆད་མི་གཙང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གང་སྟེ། ལུས་འདི་ལ་ནི་སྐྲ་དང་སྤུ་དང་། སེན་མོ་དང་། པགས་པ་དང་། པགས་ཤུན་དང་། ཤ་དང་རྒྱུས་པ་དང་། རུས་པ་དང་། རྐང་དང་། མཁལ་མ་དང་། སྙིང་དང་། མཚེར་བ་དང་། གློ་བ་དང་། མཆིན་པ་དང་། སུལ་མངས་དང་། རྒྱུ་མ་དང་། གཉེ་མ་དང་། གཞང་དང་། ལྒང་བ་དང་། ཕྱི་ས་དང་། མཆི་མ་དང་། རྔུལ་དང་། ཚིལ་དང་།
en: “Moreover, Śāradvatī­putra, great bodhisattva beings consider that this same body, from the soles of the feet upwards and the crown of the head downwards, is full of manifold impurities.

source: མཆིལ་མ་དང་། སྣབས་དང་། རྣག་དང་། ཁྲག་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། ཞག་དང་། ཆུ་སེར་དང་། དྲི་མ་དང་། གཅིན་དང་། ཀླད་པ་དང་། ཀླད་རྒྱས་དག་ཡོད་དོ་སྙམ་དུ་སོ་སོར་རྟོག་སྟེ།
en: They discern that this body comprises the hairs of the head, the hairs of the body, nails, epidermal skin, inner skin, flesh, ligaments, bones, marrow, kidneys, heart, spleen, lungs, liver, stomach, intestines, sigmoid colon, genitals, urinary bladder, excrement, tears, sweat, adipose tissue, saliva, nasal mucous, pus, serum, odors, urine, brain tissue, and cerebral secretions.

source: ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་ཁྱིམ་བདག་ཞིང་པའི་སྤྱང་འབྲུའི་རྣམ་པ་སྣ་ཚོགས་འདི་ལྟ་སྟེ། ཏིལ་དང་། འབྲས་ཐུག་པོ་ཆེ་དང་། མོན་སྲན་སྡེའུ་དང་། མོན་སྲན་ན་གུ་དང་། ནས་དང་། གྲོ་དང་། སྲན་ཆུང་དང་། འབྲས་སཱ་ལུ་དང་། འབྲུ་དང་། ཡུངས་འབྲུ་དག་གིས་གང་བ་སྒོ་དྲུང་གཉིས་སུ་བཞག་པ་ལ་སྐྱེས་བུ་མིག་དང་ལྡན་པས་མཐོང་ན། འདི་དག་ནི་ཏིལ་ཡིན་ནོ། །འདི་དག་འབྲས་ཐུག་པོ་ཆེ་ཡིན་ནོ། །འདི་དག་ནི་མོན་སྲན་སྡེའུ་ཡིན་ནོ། །འདི་དག་ནི་མོན་སྲན་ན་གུ་ཡིན་ནོ། །འདི་དག་ནི་ནས་ཡིན་ནོ། །འདི་དག་ནི་གྲོ་ཡིན་ནོ། །
en: Śāradvatī­putra, this is just as when the grain bins of a householder farmer have been placed on either side of his doorway, filled with diverse grains—sesame, husked rice, beans, kidney beans, barley, wheat, lentils, unhusked rice, [other] grains [such as millet], and mustard—and an observant passer-by, on seeing them, would know that these are sesame, these are husked rice, these are beans, these are kidney beans, these are barley, these are wheat, these are lentils, these are unhusked rice, these are [other] grains [such as millet], and these are mustard.

source: འདི་དག་ནི་སྲན་ཆུང་ཡིན་ནོ། །འདི་དག་ནི་འབྲས་སཱ་ལུ་ཡིན་ནོ། །འདི་དག་ནི་འབྲུ་ཡིན་ནོ། །འདི་དག་ནི་ཡུངས་ཀར་ཡིན་ནོ་སྙམ་དུ་ཤེས་སོ། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ལུས་འདི་ཉིད་ལ་རྐང་པའི་མཐིལ་ཡན་ཆད་སྐྲ་དང་མགོ་མན་ཆད་མི་གཙང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གང་སྟེ།
en: Śāradvatī­putra, in the same way, great bodhisattva beings discern that this very body, from the soles of the feet upwards and from the hair and the head downwards, is full of manifold impurities.

source: ལུས་འདི་ལ་ནི་སྐྲ་དང་། སྤུ་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཀླད་པ་དང་། ཀླད་རྒྱས་ཀྱི་བར་དག་ཡོད་དོ་སྙམ་དུ་སོ་སོར་རྟོག་གོ། །
en: As such, this body comprises the hairs of the head, the hairs of the body, and in the same vein, [all the aforementioned things], up to and including the brain tissue and cerebral secretions.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསྩལ་ནས། ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ཏེ།
en: Śāradvatī­putra, it is in this way that great bodhisattva beings who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to the inner body, continue to observe the physical body.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དུ་སྟེ།
en: Furthermore, they should do so without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྐྱོན་མེད་པ་ཡིན་ནོ། །
en: Śāradvatī­putra, this is the maturity of a great bodhisattva being who practices the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། ཡང་དག་པར་སྤོང་བ་བཞིའོ། །
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being who practices the transcendent perfection of wisdom also entails the four correct exertions.

source: བཞི་གང་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་རྩོལ་ལ། བརྩོན་འགྲུས་རྩོམ་སྟེ། སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་།
en: If you ask what these four are, Śāradvatī­putra, they may be described as follows: (1) They resolve, struggle, strive, persevere with tenacity, and rightly aspire that negative and non-virtuous attributes which have not yet arisen might not be developed.

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར་འདུན་པ་བསྐྱེད་ཅིང་རྩོལ་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ། སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་།
en: (2) They resolve, struggle, strive, persevere with tenacity, and rightly aspire that negative and non-virtuous attributes which have previously arisen might be renounced.

source: དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ། སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་།
en: (3) They resolve, struggle, strive, persevere with tenacity, and rightly aspire that virtuous attributes which have not yet arisen might be developed.

source: དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པ་དང་། མི་བརྗེད་པ་དང་། རྒྱས་པ་དང་། ཕྱིར་ཞིང་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: (4) They resolve, struggle, strive, persevere with tenacity, and rightly aspire that virtuous attributes which have previously arisen might remain, be unforgotten, flourish and be fully cultivated.

source: སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་ལ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དུ་སྟེ།
en: Furthermore, they do so without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ཡིན་ནོ། །
en: Śāradvatī­putra, this is the maturity of a great bodhisattva being.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞིའོ། །
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails the four supports for miraculous ability.

source: བཞི་གང་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདུན་པའི་ཏིང་ངེ་འཛིན་སྤང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་བསྒོམ་པ་དང་།
en: If you ask what these four are, Śāradvatī­putra, they may be described as follows: (1) Great bodhisattva beings imbued with renunciation, who dwell in solitude, maintaining detachment and remaining in a state of cessation, should cultivate the support for miraculous ability combining meditative stability of resolution with the formative force of exertion.

source: དེ་བཞིན་དུ་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་སྤང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམ་པ་དང་།
en: (2) Similarly, [imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation], they should cultivate the support for miraculous ability combining meditative stability of mind with the formative force of exertion.

source: བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་སྤང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམ་པ་དང་།
en: (3) [Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation], they should cultivate the support for miraculous ability combining meditative stability of perseverance with the formative force of exertion.

source: དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: (4) [Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation], they should cultivate the support for miraculous ability combining meditative stability of scrutiny with the formative force of exertion.

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་བསྒོམ་སྟེ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དུ་སྟེ།
en: “These too should be cultivated without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ཞེས་བྱའོ། །
en: Śāradvatī­putra, this is the maturity of a great bodhisattva being.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། དབང་པོ་ལྔའོ། །
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails the five faculties.

source: ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་།
en: If you ask what these five are, Śāradvatī­putra, they comprise (1) the faculty of faith, (2) the faculty of perseverance, (3) the faculty of recollection, (4) the faculty of meditative stability, and (5) the faculty of wisdom.

source: ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དུ་སྟེ།
en: These too should be cultivated without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། སྟོབས་ལྔའོ། །ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails the five powers.

source: དད་པའི་སྟོབས་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་སོ། །
en: If you ask what these five are, Śāradvatī­putra, they comprise (1) the power of faith, (2) the power of perseverance, (3) the power of recollection, (4) the power of meditative stability, and (5) the power of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ནོ། །
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails the seven branches of enlightenment.

source: བདུན་གང་ཞེ་ན་འདི་ལྟ་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་།
en: If you ask what these seven are, Śāradvatī­putra, they comprise (1) the branch of genuine enlightenment that is recollection, (2) the branch of genuine enlightenment that is doctrinal analysis, (3) the branch of genuine enlightenment that is perseverance, (4) the branch of genuine enlightenment that is delight, (5) the branch of genuine enlightenment that is mental and physical refinement, (6) the branch of genuine enlightenment that is meditative stability, and (7) the branch of genuine enlightenment that is equanimity.

source: ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དེ་ཡང་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ།
en: “[Bodhisattvas who are] imbued with renunciation, who dwell in solitude, maintaining detachment and remaining in a state of cessation, should cultivate the branch of genuine enlightenment that is recollection.

source: རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་བསྒོམ་པ་དང་། དེ་བཞིན་དུ་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་དང་དགའ་བ་དང་ཤིན་ཏུ་སྦྱངས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས་ཡོངས་སུ་བསྒྱུར་བ་བསྒོམ་སྟེ།
en: Similarly, [bodhisattvas who are] imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation should cultivate the branch of genuine enlightenment that is doctrinal analysis, and the [other] branches of genuine enlightenment, comprising perseverance, delight, mental and physical refinement, meditative stability, and equanimity.

source: དེ་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བསྒོམ་སྟེ།
en: All these too should be cultivated without apprehending anything.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་།
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails [the observance of] the noble eightfold path.

source: ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཉིད་ནི་བརྒྱད་པ་ཡིན་ཏེ།
en: If you ask what these eight aspects are, Śāradvatī­putra, they comprise (1) correct view, (2) correct thought, (3) correct speech, (4) correct action, (5) correct livelihood, (6) correct effort, (7) correct recollection, and (8) correct meditative stability.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་གཉིས་སུ་མེད་པར་ཤེས་པ་ལ་འཇུག་པས་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails absorption in the three gateways to liberation by engaging in the understanding that all things are without duality.

source: ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་མི་རྟོག་ཅིང་བསམ་གཏན་གྱི་བདེ་བ་ལ་རོ་མྱང་བ་མེད་པར་བསམ་གཏན་བཞི་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It further entails absorption in the four meditative concentrations, experiencing all things non-conceptually, without relishing the bliss of meditative concentration.

source: ཆོས་ཐམས་ཅད་མི་སྐྱེ་བར་བཟོད་པ་ལ་འཇུག་པས་ཚད་མེད་པ་བཞི་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It entails the absorption in the four immeasurable aspirations through acceptance that phenomena are non-arising.

source: ཁམས་གསུམ་དམིགས་སུ་མེད་པར་ཤེས་པས་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It entails absorption in the four formless meditative absorptions by understanding that the three world systems are non-apprehensible.

source: སེམས་དང་ཡིད་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་བྲལ་བས་རྣམ་པར་ཐར་བ་བརྒྱད་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: “It entails absorption in the eight aspects of liberation, without mind, the mental faculty, and mental consciousness.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་གཉིས་སུ་མེད་པར་མཐོང་བས། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It entails absorption in the nine serial steps of meditative absorption by perceiving cyclic existence and nirvāṇa without duality.

source: ཆོས་ཐམས་ཅད་སྨིག་རྒྱུ་ལྟ་བུ་ལ་འཇུག་པས་འདུ་ཤེས་དགུ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It entails absorption in the nine contemplations of impurity by engaging with all things as if they were a mirage.

source: དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པར་རྗེས་སུ་དྲན་པ་བཅུ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It entails absorption in the ten recollections, without the need for mindfulness and without the need for mentation.

source: ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུ་ལ་འཇུག་པས་འདུ་ཤེས་དྲུག་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It entails absorption in the six aspects of perception by engaging with all things as if they were an illusion.

source: ཤེས་པ་དང་མི་ཤེས་པའི་ཆོས་མཉམ་པས་ཤེས་པ་བཅུ་ལ་འཇུག་པ་དང་།
en: “Furthermore, it entails engagement in the ten kinds of knowledge by regarding all things, known and unknown, as the same.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་མཉམ་པར་བཞག་པར་རྟོགས་ནས་གསུམ་ལ་སྙོམས་པར་འཇུག་པ་དང་།
en: It entails absorption in the three [modes of meditative stability], having realized that all things are naturally in absorption.

source: དུས་གསུམ་དང་བྲལ་བའི་ཤེས་པས་དབང་པོ་གསུམ་བསྒོམ་པ་དང་།
en: It entails the meditations on the three faculties [enabling knowledge of all that is unknown, acquiring the knowledge of all things, and endowed with the knowledge of all things] by means of knowledge that is free from [the limitations] of past, present, and future.
